app/controllers/members_controller.rb

  def index
    @members = Member.order("number")
---
SELECT "members".* FROM "members" ORDER BY number

  def create
    @member = Member.new(params[:member])
    if @member.save
---
INSERT INTO "members" ("number", "name", "full_name", "email", "birthday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @member = Member.find(params[:id])
    # フォームデータのセット
    @member.assign_attributes(params[:member])
    if @member.save
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "members" SET "number" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["number", 22], ["updated_at", "2018-11-07 11:43:14.175280"], ["id", 1]]

  def destroy
    @member = Member.find(params[:id])
    @member.destroy
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 12]]

  def search
    @members = Member.search(params[:q])
---
SELECT "members".* FROM "members" WHERE (name LIKE '%佐藤%' OR full_name LIKE '%佐藤%') ORDER BY number